# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-l object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/rtdetr

## Parameters
#nc: 80  # number of classes
#scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
#  # [depth, width, max_channels]
#  l: [1.00, 1.00, 1024]
#
## From BiliBili 魔鬼面具
#backbone:
#  # [from, repeats, module, args]
#  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']] # 0-P1/2
#  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']] # 1
#  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']] # 2
#  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 3-P2/4
#
#  # [ch_out, block_type, block_nums, stage_num, act, variant]
#  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']] # 4
#  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']] # 5-P3/8
#  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']] # 6-P4/16
#  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']] # 7-P5/32
#
#head:
#  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 8 input_proj.2
#  - [-1, 1, AIFI, [1024, 8]] # 9
#  - [-1, 1, Conv, [256, 1, 1]]  # 10, Y5, lateral_convs.0
#
#  - [-1, 1, SNI, [2]] # 11
#  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 12 input_proj.1
#  - [[-2, -1], 1, MFM, [256]] # 13
#  - [-1, 3, RepC3, [256, 0.5]]  # 14, fpn_blocks.0
#  - [-1, 1, Conv, [128, 1, 1]]   # 15, Y4, lateral_convs.1
#
#  - [-1, 1, SNI, [2]] # 16
#  - [4, 1, SPDConv, [128]] # 17
#  - [[-1, -2, 5], 1, MFM, [256]] # 18
#  - [-1, 1, CSPOmniKernel, []] # 19
#  - [-1, 3, RepC3, [256, 0.5]] # 20
#
#  - [-1, 1, GSConvE, [256, 3, 2]] # 21
#  - [[-1, 15], 1, MFM, [256]] # 22
#  - [-1, 3, RepC3, [256, 0.5]] # 23
#
#  - [-1, 1, GSConvE, [256, 3, 2]] # 24
#  - [[-1, 10], 1, MFM, [256]] # 25
#  - [-1, 3, RepC3, [256, 0.5]] # 26
#
#  - [[20, 23, 26], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # RTDETRDecoder(P3, P4, P5)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 1, C2f_DCMB, [128]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 1, C2f_DCMB, [256]]
  - [-1, 1, Conv, [384, 3, 2]]  # 5-P4/16
  - [-1, 1, C2f_DCMB, [384]]
  - [-1, 1, Conv, [384, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f_DCMB, [384]]

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 9  project P5 (384→256)
  - [-1, 1, AIFI, [1024, 8]]                       # 10 AIFI 全局注意力
  - [-1, 1, Conv, [256, 1, 1]]                     # 11 lateral_convs.0 (Y5)

  # --- FPN P4 ---
  - [ -1, 1, SNI, [ 2 ] ] # 11
  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]]   # 13 project P4 (384→256)
  - [[-2, -1], 1, MFM, [1]]                    # 14 concat(P4_proj, up_Y5) →512
  - [-1, 3, RepC3, [256, 0.5]]                    # 15 fpn_blocks.0, 输出256

  # --- FPN P3 + SOEP SmallObjectEnhancePyramid ---
  - [ -1, 1, SNI, [ 2 ] ]
  - [-1, 1, Conv, [128, 1, 1, None, 1, 1, False]]  # 17 P4_to128 (256→128)
  - [1, 1, SPDConv, [128, 128]]                    # 18 SPD 小目标增强 (P2:128→128)
  - [4, 1, Conv, [128, 1, 1, None, 1, 1, False]]   # 19 P3_to128 (P3:256→128)
  - [[-3, -2, -1], 1, MFM, [1]]                 # 20 concat(P4_to128, SPD, P3_to128)=384
  - [-1, 1, CSPOmniKernel, []]                     # 21 CSP-OmniKernel(384→384)
  - [-1, 3, RepC3, [256, 0.5]]                     # 22 fpn_blocks.1, 输出256

  # --- PAN P4 ---
  - [-1, 1, GSConvE, [256, 3, 2]]
  - [[-1, 15], 1, MFM, [1]]                     # 24 concat(down_fpn_P3, fpn_P4)=512
  - [-1, 3, RepC3, [256, 0.5]]                     # 25 pan_blocks.0, 输出256

  # --- PAN P5 ---
  - [-1, 1, GSConvE, [256, 3, 2]]
  - [[-1, 11], 1, MFM, [1]]                     # 27 concat(down_pan_P4, Y5)=512
  - [-1, 3, RepC3, [256, 0.5]]                     # 28 pan_blocks.1, 输出256

  # --- 检出头 ---
  - [[22, 25, 28], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # 29 Detect(P3,P4,P5)