# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-l object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/rtdetr

# Parameters
nc: 10  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

# From BiliBili 魔鬼面具
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 1, C2f_DCMB, [128]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 1, C2f_DCMB, [256]]
  - [-1, 1, Conv, [384, 3, 2]]  # 5-P4/16
  - [-1, 1, C2f_DCMB, [384]]
  - [-1, 1, Conv, [384, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f_DCMB, [384]]

head:
  # --- P5 分支 ---
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 9  project P5 (384→256)
  - [-1, 1, AIFI, [1024, 8]]                       # 10 AIFI 全局注意力
  #- [-1, 1, TransformerEncoderLayer_Pola_EDFFN_Mona_DyT, [1024, 8]]
  - [-1, 1, Conv, [256, 1, 1]]                     # 11 lateral_convs.0 (Y5)

  # --- FPN P4 ---
  #- [-1, 1, nn.Upsample, [None, 2, 'nearest']]     # 12 upsample Y5
  - [-1, 1, SNI, [2]]
  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]]   # 13 project P4 (384→256)
  - [[-2, -1], 1, Concat, [1]]                    # 14 concat(P4_proj, up_Y5) →512
  #- [[-2, -1], 1, MFM, [256]]
  - [-1, 3, RepC3, [256, 0.5]]                    # 15 fpn_blocks.0, 输出256

  # --- FPN P3 + SOEP SmallObjectEnhancePyramid ---
  #- [-1, 1, nn.Upsample, [None, 2, 'nearest']]     # 16 upsample fpn_P4 (256→same spatial)
  - [-1, 1, SNI, [2]]
  - [-1, 1, Conv, [128, 1, 1, None, 1, 1, False]]  # 17 P4_to128 (256→128)
  - [1, 1, SPDConv, [128, 128]]                    # 18 SPD 小目标增强 (P2:128→128)
  - [4, 1, Conv, [128, 1, 1, None, 1, 1, False]]   # 19 P3_to128 (P3:256→128)
  - [[-3, -2, -1], 1, Concat, [1]]                 # 20 concat(P4_to128, SPD, P3_to128)=384
  #- [[-3, -2, -1], 1, MFM, [256]]
  - [-1, 1, CSPOmniKernel, []]                     # 21 CSP-OmniKernel(384→384)
  - [-1, 3, RepC3, [256, 0.5]]                     # 22 fpn_blocks.1, 输出256

  # --- PAN P4 ---
  #- [-1, 1, Conv, [256, 3, 2]]                     # 23 downsample fpn_P3 (256→256)
  - [-1, 1, GSConvE, [256, 3, 2]]
  - [[-1, 15], 1, Concat, [1]]                     # 24 concat(down_fpn_P3, fpn_P4)=512
  #- [[-1, 15], 1, MFM, [256]]
  - [-1, 3, RepC3, [256, 0.5]]                     # 25 pan_blocks.0, 输出256

  # --- PAN P5 ---
  #- [-1, 1, Conv, [256, 3, 2]]                     # 26 downsample pan_P4 (256→256)
  - [-1, 1, GSConvE, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]                     # 27 concat(down_pan_P4, Y5)=512
  #- [[-1, 11], 1, MFM, [256]]
  - [-1, 3, RepC3, [256, 0.5]]                     # 28 pan_blocks.1, 输出256

  # --- 检出头 ---
  - [[22, 25, 28], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # 29 Detect(P3,P4,P5)
